app/helpers/carts_helper.rb

    def current_cart
        @current_cart = []
        @cart_items = CartItem.all
        @cart_items.each do |item|
---
SELECT "cart_items".* FROM "cart_items"

    def cart_total
        @price = 0
        current_cart.each do |cart_item|
            @price += Item.find(cart_item.item_id).price
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]