app/views/items/show.html.erb

    <div class="item-infos border border-warning">
        <% item = Item.find(params[:id].to_i) %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]