app/controllers/carts_controller.rb

INSERT INTO "cart_items" ("item_id", "user_id", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item_id", 5], ["user_id", 1], ["quantity", 1], ["price", 100], ["created_at", "2022-03-17 11:25:47.798785"], ["updated_at", "2022-03-17 11:25:47.798785"]]
---
  def create
    :authenticate_user
    @cart_item = CartItem.new(permit_params)
    if @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 11]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def destroy
    CartItem.find(params[:id].to_i).destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_price
    return Item.find(params[:item_id].to_i).price